Revit 2026 API

# RenderingImageExposureSettingsExposureValue Property

---

The value of rendering image exposure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ExposureValue { get; set; }
```
```vb
Public Property ExposureValue As Double
	Get
	Set
```
```cpp
public:
property double ExposureValue {
	double get ();
	void set (double value);
}
```
```fsharp
member ExposureValue : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value of rendering image exposure is not valid. The valid range is 0 to 21. |

Default exposure value based on Lighting Scheme.

#### Reference

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace